#Задача 1: Сложение значений списка
#Напишите программу с помощью цикла for, которая суммирует все числа в списке.
my_list = [1, 2, 3, 4, 5]
sum = 0
for n in my_list:   
    sum = sum + n
print(sum);