#Задача 3: Объединение множеств
#Создайте два множества, объедините их и выведите результат
m1 = {2,3,4,5,6}
m2 = {5,6,7,8}
m =  m1.union(m2)
print('Объденение {2,3,4,5,6} и {5,6,7,8}: ', m)
