#№Задача 4: Пересечение множеств
#Создайте два множества, найдите пересечение и выведите результат
m1 = {1,2,3}
m2 = {2,3,4,5}
m = m1.intersection(m2)
print('Пересечение {1,2,3} и  {2,3,4,5}: ', m)