#5. Напишите свою собственную игру - камень ножницы бумага Игра должна идти до 3-х побед, и выводить кто победил
i = 1
win_a = 0
win_b = 0
while i <=3:
    a = input('Ход игрока А ("к", "н", или "б"): ')
    b = input('Ход игрока Б ("к", "н", или "б"): ')
    
    if (a == 'к' and b == 'н') or (a == 'н' and b == 'б') or (a == 'б' and b == 'к'):
        win_a += 1
        print('В броске побеждает А:', win_a, 'побед')
        i +=1
    elif (a == 'н' and b == 'к') or (a == 'б' and b == 'н') or (a == 'к' and b == 'б'):
        win_b += 1;
        print('В броске побеждает Б: ',  win_b, ':побед')
        i +=1  
    elif a == b:
        print('ничья')   
if win_a > win_b:
    print('Победил игрок А')
else:
    print('Победил игрок Б')      